app/views/input_screens/_input_screen_button_bar.html.erb

SELECT  `team_rounds`.* FROM `team_rounds` WHERE `team_rounds`.`team_id` = 2 AND `team_rounds`.`round_id` = 1 ORDER BY `team_rounds`.`id` ASC LIMIT 1
---
<div class="row mb-3">
  <% current_team.rounds.each do |round| %>

SELECT `related_reports`.* FROM `related_reports` WHERE `related_reports`.`input_screen_id` = 2
---
      <option value="Related Reports" class="text-italic"><i>Related Reports</i></option>
      <% input_screen.related_reports.each do |report| %>