app/controllers/input_screens_controller.rb

SELECT  `input_screens`.* FROM `input_screens` WHERE `input_screens`.`input_screen_number` = 2 ORDER BY `input_screens`.`id` ASC LIMIT 1
SELECT  `team_rounds`.* FROM `team_rounds` WHERE `team_rounds`.`team_id` = 2 AND `team_rounds`.`round_id` = 1 ORDER BY `team_rounds`.`id` ASC LIMIT 1
SELECT  `team_round_input_screens`.* FROM `team_round_input_screens` WHERE `team_round_input_screens`.`team_round_id` = 4 AND `team_round_input_screens`.`input_screen_id` = 2 ORDER BY `team_round_input_screens`.`id` ASC LIMIT 1
UPDATE `team_round_input_screens` SET `was_visited` = TRUE WHERE `team_round_input_screens`.`id` = 38
---
  def show_input_screen
    puts "Show INput Screen"
    @input_screen = InputScreen.where(:input_screen_number => params[:input_screen_id]).first

    simulation = current_team.simulation
    @round = simulation.get_current_round
    @team_round = TeamRound.where(:team => current_team).where(:round => @round).first
    ap @team_round
    @team_round_input_screen = TeamRoundInputScreen.where(:team_round => @team_round).where(:input_screen => @input_screen).first
    @team_round_input_screen.was_visited = true
    @team_round_input_screen.save!